OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e_features.h
#define TIM_CCER_CC1NE_SHIFT                   (2)
#define TIM_CCER_CC1NE_MASK                    (0x01U << TIM_CCER_CC1NE_SHIFT)
#define TIM_CCER_CC1NE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC1NE_SHIFT)) & TIM_CCER_CC1NE_MASK)

#define TIM_CCER_CC1P_SHIFT                    (1)
#define TIM_CCER_CC1P_MASK                     (0x01U << TIM_CCER_CC1P_SHIFT)
#define TIM_CCER_CC1P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC1P_SHIFT)) & TIM_CCER_CC1P_MASK)

#define TIM_CCER_CC1E_SHIFT                    (0)
#define TIM_CCER_CC1E_MASK                     (0x01U << TIM_CCER_CC1E_SHIFT)
#define TIM_CCER_CC1E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC1E_SHIFT)) & TIM_CCER_CC1E_MASK)

/*!
 * @brief TIM_CNT Register Bit Definition
 */

#define TIM_CNT_CNT_SHIFT                      (0)
#define TIM_CNT_CNT_MASK                       (0xFFFFU << TIM_CNT_CNT_SHIFT)
#define TIM_CNT_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CNT_CNT_SHIFT)) & TIM_CNT_CNT_MASK)

/*!
 * @brief TIM_PSC Register Bit Definition
 */

#define TIM_PSC_PSC_SHIFT                      (0)
#define TIM_PSC_PSC_MASK                       (0xFFFFU << TIM_PSC_PSC_SHIFT)
#define TIM_PSC_PSC(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_PSC_PSC_SHIFT)) & TIM_PSC_PSC_MASK)

/*!
 * @brief TIM_ARR Register Bit Definition
 */

#define TIM_ARR_ARR_SHIFT                      (0)
#define TIM_ARR_ARR_MASK                       (0xFFFFU << TIM_ARR_ARR_SHIFT)
#define TIM_ARR_ARR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_ARR_ARR_SHIFT)) & TIM_ARR_ARR_MASK)

/*!
 * @brief TIM_RCR Register Bit Definition
 */

#define TIM_RCR_REPCNT_SHIFT                   (8)
#define TIM_RCR_REPCNT_MASK                    (0xFFU << TIM_RCR_REPCNT_SHIFT)
#define TIM_RCR_REPCNT(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_RCR_REPCNT_SHIFT)) & TIM_RCR_REPCNT_MASK)

#define TIM_RCR_REP_SHIFT                      (0)
#define TIM_RCR_REP_MASK                       (0xFFU << TIM_RCR_REP_SHIFT)
#define TIM_RCR_REP(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_RCR_REP_SHIFT)) & TIM_RCR_REP_MASK)

/*!
 * @brief TIM_CCR Register Bit Definition
 */

#define TIM_CCR_CCR_SHIFT                      (0)
#define TIM_CCR_CCR_MASK                       (0xFFFFU << TIM_CCR_CCR_SHIFT)
#define TIM_CCR_CCR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CCR_CCR_SHIFT)) & TIM_CCR_CCR_MASK)

/*!
 * @brief TIM_BDTR Register Bit Definition
 */

#define TIM_BDTR_DOE_SHIFT                     (16)
#define TIM_BDTR_DOE_MASK                      (0x01U << TIM_BDTR_DOE_SHIFT)
#define TIM_BDTR_DOE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_DOE_SHIFT)) & TIM_BDTR_DOE_MASK)

#define TIM_BDTR_MOE_SHIFT                     (15)
#define TIM_BDTR_MOE_MASK                      (0x01U << TIM_BDTR_MOE_SHIFT)
#define TIM_BDTR_MOE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_MOE_SHIFT)) & TIM_BDTR_MOE_MASK)

#define TIM_BDTR_AOE_SHIFT                     (14)
#define TIM_BDTR_AOE_MASK                      (0x01U << TIM_BDTR_AOE_SHIFT)
#define TIM_BDTR_AOE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_AOE_SHIFT)) & TIM_BDTR_AOE_MASK)

#define TIM_BDTR_BKP_SHIFT                     (13)
#define TIM_BDTR_BKP_MASK                      (0x01U << TIM_BDTR_BKP_SHIFT)
#define TIM_BDTR_BKP(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_BKP_SHIFT)) & TIM_BDTR_BKP_MASK)

#define TIM_BDTR_BKE_SHIFT                     (12)
#define TIM_BDTR_BKE_MASK                      (0x01U << TIM_BDTR_BKE_SHIFT)
#define TIM_BDTR_BKE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_BKE_SHIFT)) & TIM_BDTR_BKE_MASK)

#define TIM_BDTR_OSSR_SHIFT                    (11)
#define TIM_BDTR_OSSR_MASK                     (0x01U << TIM_BDTR_OSSR_SHIFT)
#define TIM_BDTR_OSSR(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_OSSR_SHIFT)) & TIM_BDTR_OSSR_MASK)

#define TIM_BDTR_OSSI_SHIFT                    (10)
#define TIM_BDTR_OSSI_MASK                     (0x01U << TIM_BDTR_OSSI_SHIFT)
#define TIM_BDTR_OSSI(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_OSSI_SHIFT)) & TIM_BDTR_OSSI_MASK)

#define TIM_BDTR_LOCK_SHIFT                    (8)
#define TIM_BDTR_LOCK_MASK                     (0x3U << TIM_BDTR_LOCK_SHIFT)
#define TIM_BDTR_LOCK(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_LOCK_SHIFT)) & TIM_BDTR_LOCK_MASK)

#define TIM_BDTR_DTG_SHIFT                     (0)
#define TIM_BDTR_DTG_MASK                      (0xFFU << TIM_BDTR_DTG_SHIFT)
#define TIM_BDTR_DTG(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_BDTR_DTG_SHIFT)) & TIM_BDTR_DTG_MASK)

/*!
 * @brief TIM_DCR Register Bit Definition
 */

#define TIM_DCR_DBL_SHIFT                      (8)
#define TIM_DCR_DBL_MASK                       (0x1FU << TIM_DCR_DBL_SHIFT)
#define TIM_DCR_DBL(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_DCR_DBL_SHIFT)) & TIM_DCR_DBL_MASK)

#define TIM_DCR_DBA_SHIFT                      (0)
#define TIM_DCR_DBA_MASK                       (0x1FU << TIM_DCR_DBA_SHIFT)
#define TIM_DCR_DBA(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_DCR_DBA_SHIFT)) & TIM_DCR_DBA_MASK)

/*!
 * @brief TIM_DMAR Register Bit Definition
 */

#define TIM_DMAR_DMAB_SHIFT                    (0)
#define TIM_DMAR_DMAB_MASK                     (0xFFFFU << TIM_DMAR_DMAB_SHIFT)
#define TIM_DMAR_DMAB(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_DMAR_DMAB_SHIFT)) & TIM_DMAR_DMAB_MASK)

/*!
 * @brief TIM_CCMR3 Register Bit Definition
 */

#define TIM_CCMR3_OC5M_SHIFT                   (4)
#define TIM_CCMR3_OC5M_MASK                    (0x7U << TIM_CCMR3_OC5M_SHIFT)
#define TIM_CCMR3_OC5M(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCMR3_OC5M_SHIFT)) & TIM_CCMR3_OC5M_MASK)

#define TIM_CCMR3_OC5PE_SHIFT                  (3)
#define TIM_CCMR3_OC5PE_MASK                   (0x01U << TIM_CCMR3_OC5PE_SHIFT)
#define TIM_CCMR3_OC5PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_CCMR3_OC5PE_SHIFT)) & TIM_CCMR3_OC5PE_MASK)

#define TIM_CCMR3_OC5FE_SHIFT                  (2)
#define TIM_CCMR3_OC5FE_MASK                   (0x01U << TIM_CCMR3_OC5FE_SHIFT)
#define TIM_CCMR3_OC5FE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_CCMR3_OC5FE_SHIFT)) & TIM_CCMR3_OC5FE_MASK)

/*!
 * @brief TIM_CCR5 Register Bit Definition
 */

#define TIM_CCR5_CCR5_SHIFT                    (0)
#define TIM_CCR5_CCR5_MASK                     (0xFFFFU << TIM_CCR5_CCR5_SHIFT)
#define TIM_CCR5_CCR5(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCR5_CCR5_SHIFT)) & TIM_CCR5_CCR5_MASK)

/*!
 * @brief TIM_PDER Register Bit Definition
 */

