OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e_features.h
#define TIM_PDER_CCR5SHIFTEN_SHIFT             (5)
#define TIM_PDER_CCR5SHIFTEN_MASK              (0x01U << TIM_PDER_CCR5SHIFTEN_SHIFT)
#define TIM_PDER_CCR5SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR5SHIFTEN_SHIFT)) & TIM_PDER_CCR5SHIFTEN_MASK)

#define TIM_PDER_CCR4SHIFTEN_SHIFT             (4)
#define TIM_PDER_CCR4SHIFTEN_MASK              (0x01U << TIM_PDER_CCR4SHIFTEN_SHIFT)
#define TIM_PDER_CCR4SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR4SHIFTEN_SHIFT)) & TIM_PDER_CCR4SHIFTEN_MASK)

#define TIM_PDER_CCR3SHIFTEN_SHIFT             (3)
#define TIM_PDER_CCR3SHIFTEN_MASK              (0x01U << TIM_PDER_CCR3SHIFTEN_SHIFT)
#define TIM_PDER_CCR3SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR3SHIFTEN_SHIFT)) & TIM_PDER_CCR3SHIFTEN_MASK)

#define TIM_PDER_CCR2SHIFTEN_SHIFT             (2)
#define TIM_PDER_CCR2SHIFTEN_MASK              (0x01U << TIM_PDER_CCR2SHIFTEN_SHIFT)
#define TIM_PDER_CCR2SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR2SHIFTEN_SHIFT)) & TIM_PDER_CCR2SHIFTEN_MASK)

#define TIM_PDER_CCR1SHIFTEN_SHIFT             (1)
#define TIM_PDER_CCR1SHIFTEN_MASK              (0x01U << TIM_PDER_CCR1SHIFTEN_SHIFT)
#define TIM_PDER_CCR1SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR1SHIFTEN_SHIFT)) & TIM_PDER_CCR1SHIFTEN_MASK)

#define TIM_PDER_CCDREPE_SHIFT                 (0)
#define TIM_PDER_CCDREPE_MASK                  (0x01U << TIM_PDER_CCDREPE_SHIFT)
#define TIM_PDER_CCDREPE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCDREPE_SHIFT)) & TIM_PDER_CCDREPE_MASK)

/*!
 * @brief TIM_CCRFALL Register Bit Definition
 */

#define TIM_CCRFALL_CCRFALL_SHIFT              (0)
#define TIM_CCRFALL_CCRFALL_MASK               (0xFFFFU << TIM_CCRFALL_CCRFALL_SHIFT)
#define TIM_CCRFALL_CCRFALL(x)                 (((uint32_t)(((uint32_t)(x)) << TIM_CCRFALL_CCRFALL_SHIFT)) & TIM_CCRFALL_CCRFALL_MASK)

/*!
 * @brief TIM_BKINF Register Bit Definition
 */

#define TIM_BKINF_COMPBKINSEL_SHIFT             (13)
#define TIM_BKINF_COMPBKINSEL_MASK              (0x7U << TIM_BKINF_COMPBKINSEL_SHIFT)
#define TIM_BKINF_COMPBKINSEL(x)                (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_COMPBKINSEL_SHIFT)) & TIM_BKINF_COMPBKINSEL_MASK)

#define TIM_BKINF_IOBKINSEL_SHIFT              (6)
#define TIM_BKINF_IOBKINSEL_MASK               (0xFU << TIM_BKINF_IOBKINSEL_SHIFT)
#define TIM_BKINF_IOBKINSEL(x)                 (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_IOBKINSEL_SHIFT)) & TIM_BKINF_IOBKINSEL_MASK)

#define TIM_BKINF_CSSBKINSEL_SHIFT             (5)
#define TIM_BKINF_CSSBKINSEL_MASK              (0x01U << TIM_BKINF_CSSBKINSEL_SHIFT)
#define TIM_BKINF_CSSBKINSEL(x)                (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_CSSBKINSEL_SHIFT)) & TIM_BKINF_CSSBKINSEL_MASK)

#define TIM_BKINF_BKINF_SHIFT                  (1)
#define TIM_BKINF_BKINF_MASK                   (0xFU << TIM_BKINF_BKINF_SHIFT)
#define TIM_BKINF_BKINF(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_BKINF_SHIFT)) & TIM_BKINF_BKINF_MASK)

#define TIM_BKINF_BKINFE_SHIFT                 (0)
#define TIM_BKINF_BKINFE_MASK                  (0x01U << TIM_BKINF_BKINFE_SHIFT)
#define TIM_BKINF_BKINFE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_BKINFE_SHIFT)) & TIM_BKINF_BKINFE_MASK)

/*!
 * @}
 */ /* end of group TIM_Register_Masks */

/*!
 * @}
 */ /* end of group TIM_Peripheral_Access_Layer */



 #endif /* __MM32F5277E_FEATURES_H__ */
